Tekla Open API Reference for Tekla Structures 2025
Grid.Attributes Property
 The attributes of the grid. For more information see Grid.GridAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Grid.GridAttributes Attributes { get; set; }
Public Property Attributes As Grid.GridAttributes
	Get
	Set
Property Value
Type: Grid.GridAttributes
See Also
Reference
Grid Class
Tekla.Structures.Drawing Namespace